//
//  File.swift
//  iosMathTest
//
//  Created by Admin on 1/1/2001.
//  Copyright © 2001 Admin. All rights reserved.
//


import Foundation


class dataBase {
    let question = [[["請先準備鉛筆和算草紙 \\circ ", "2 \\frac{_1}{^6} + \\frac{_2}{^3} \\div \\frac{_4}{^5} =?", "先選擇木板, 再按入數字, ", "最多可輸入三位數,答案可能是", "真分數或整數, 最後按確定 \\circ"],
                     ["", "3 \\frac{_2}{^5} + \\frac{_3}{^8} \\div \\frac{_5}{^8} =?", "先選擇木板, 再按入數字, ", "最多可輸入三位數,答案可能是", "真分數或整數, 最後按確定 \\circ"]],
                    
                    //2
        [["", "9 \\frac{_1}{^7} - \\frac{_3}{^7} \\times 1 \\frac{_1}{^2} =? ", "先選擇木板, 再按入數字, ", "最多可輸入三位數,答案可能是", "真分數或整數, 最後按確定 \\circ"],
         ["", "6 \\frac{_3}{^5} - \\frac{_1}{^5} \\times 3 \\frac{_1}{^2} =? ", "先選擇木板, 再按入數字, ", "最多可輸入三位數,答案可能是", "真分數或整數, 最後按確定 \\circ"]],
        
        //3
        [["","","2 \\frac{_5}{^8} \\div (5-1 \\frac{_1}{^4} )=?","",""],
         ["","","4 \\frac{_1}{^6} \\div (6-2 \\frac{_2}{^3} )=?","",""]],
        
        //4
        [["西瓜每公斤售10 \\frac{_1}{^5} 元,外婆希望", "為大家消暑,便付50元買一個重", "3 \\frac{_1}{^2} kg的西瓜,店員應找回多少元?", "", ""],
         ["西瓜每公斤售10 \\frac{_1}{^4} 元,外婆希望", "為大家消暑,便付50元買一個重", "3 \\frac{_1}{^5} kg的西瓜,店員應找回多少元?", "", ""]],
        
        //5
        [["哥哥為參加聚會的小朋友包裝禮", "物,用了長3 \\frac{_3}{^5} 米的藍絲帶的 \\frac{_5}{^8} ,", "又用了長4 \\frac{_7}{^1^0} 米的紅絲帶的其中", " \\frac{_3}{^4} 米,他共用去絲帶多少米?", ""],
         ["哥哥為參加聚會的小朋友包裝禮", "物,用了長3 \\frac{_1}{^5} 米的藍絲帶其中的 \\frac{_1}{^4} 米 ,", "又用了長4 \\frac{_1}{^5} 米的紅絲帶的", " \\frac{_5}{^1^2} ,他共用去絲帶多少米?", ""]],
        
        //6
        [["哥哥為參加聚會的小朋友包裝禮", "物,用了長3 \\frac{_3}{^5} 米的藍絲帶的 \\frac{_5}{^8} ,", "又用了長4 \\frac{_7}{^1^0} 米的紅絲帶的其中", " \\frac{_3}{^4} 米,他共用去絲帶多少米?", ""],
         ["哥哥為參加聚會的小朋友包裝禮", "物,用了長3 \\frac{_1}{^5} 米的藍絲帶其中的 \\frac{_1}{^4} 米 ,", "又用了長4 \\frac{_1}{^5} 米的紅絲帶的", " \\frac{_5}{^1^2} ,他共用去絲帶多少米?", ""]],
        
        //7
        [["酒店有85 \\frac{_1}{^2}公斤的糖果和", "40 \\frac{_1}{^2} 公斤的巧克力,各取去 \\frac{_5}{^9}", "送給區內一所醫院裏患上長期病", "症的兒童,酒店還有多少公斤的", "糖果和巧克力來招待住客? "],
         ["酒店有66 \\frac{_3}{^5}公斤的糖果和", "45 \\frac{_2}{^5} 公斤的巧克力,各取去 \\frac{_4}{^7}", "送給區內一所醫院裏患上長期病", "症的兒童,酒店還有多少公斤的", "糖果和巧克力來招待住客? "]],
        //8 ans
        [["酒店有85 \\frac{_1}{^2}公斤的糖果和", "40 \\frac{_1}{^2} 公斤的巧克力,各取去 \\frac{_5}{^9}", "送給區內一所醫院裏患上長期病", "症的兒童,酒店還有多少公斤的", "糖果和巧克力來招待住客? "],
         ["酒店有66 \\frac{_3}{^5}公斤的糖果和", "45 \\frac{_2}{^5} 公斤的巧克力,各取去 \\frac{_4}{^7}", "送給區內一所醫院裏患上長期病", "症的兒童,酒店還有多少公斤的", "糖果和巧克力來招待住客? "]],
        //9
        [["一所學校舉辦義賣活動來協助", "山區重建學校,參加的女生佔 \\frac{_4}{^7},", "教師佔 \\frac{_3}{^1^4},男生有210人, ", "這所學校的所有參加者共有", "多少人? "],
         ["一所學校舉辦義賣活動來協助", "山區重建學校,參加的女生佔 \\frac{_2}{^5},", "教師佔 \\frac{_3}{^1^0},男生有180人, ", "這所學校的所有參加者共有", "多少人? "]],
        //10 ans
        [["一所學校舉辦義賣活動來協助", "山區重建學校,參加的女生佔 \\frac{_4}{^7},", "教師佔 \\frac{_3}{^1^4},男生有210人, ", "這所學校的所有參加者共有", "多少人? "],
         ["一所學校舉辦義賣活動來協助", "山區重建學校,參加的女生佔 \\frac{_2}{^5},", "教師佔 \\frac{_3}{^1^0},男生有180人, ", "這所學校的所有參加者共有", "多少人? "]],
        //11
        [["為了準備下午的聚會,表妹幫忙", "搬來了8本歌書,共重4 \\frac{_4}{^2^5} kg, ", "表哥也幫忙搬了10本歌書, ", "這10本歌書共重多少kg? ", ""],
         ["為了準備下午的聚會,表妹幫忙", "搬來了6本歌書,共重3 \\frac{_3}{^5} kg, ", "表哥也幫忙搬了10本歌書, ", "這10本歌書共重多少kg? ", ""]],
        //12 ans
        [["為了準備下午的聚會,表妹幫忙", "搬來了8本歌書,共重4 \\frac{_4}{^2^5} kg, ", "表哥也幫忙搬了10本歌書, ", "這10本歌書共重多少kg? ", ""],
         ["為了準備下午的聚會,表妹幫忙", "搬來了6本歌書,共重3 \\frac{_3}{^5} kg, ", "表哥也幫忙搬了10本歌書, ", "這10本歌書共重多少kg? ", ""]],
        //13
        [["老師預備下星期的籌款午餐訂購", "了9 \\frac{_3}{^8} kg的麪包,需付250元 \\circ ", "今天有更多同學報名參加, ", "如果把訂購修改為12 \\frac{_3}{^4} kg的麪包, ", "需付多少元?"],
         ["老師預備下星期的籌款午餐訂購", "了7 \\frac{_1}{^5} kg的麪包,需付240元 \\circ ", "今天有更多同學報名參加, ", "如果把訂購修改為10 \\frac{_4}{^5} kg的麪包, ", "需付多少元?"]],
        //14 ans
        [["老師預備下星期的籌款午餐訂購", "了9 \\frac{_3}{^8} kg的麪包,需付250元 \\circ ", "今天有更多同學報名參加, ", "如果把訂購修改為12 \\frac{_3}{^4} kg的麪包, ", "需付多少元?"],
         ["老師預備下星期的籌款午餐訂購", "了7 \\frac{_1}{^5} kg的麪包,需付240元 \\circ ", "今天有更多同學報名參加, ", "如果把訂購修改為10 \\frac{_4}{^5} kg的麪包, ", "需付多少元?"]],
        //15
        [["汽油每公升售20 \\frac{_1}{^4} 元,每升汽油", "可供小艇航行4 \\frac{_1}{^2} km \\circ ", "舅父駕小艇到海岸公園為保育", "計劃作資料搜集,共航行了", "8 \\frac{_4}{^5} km,他需汽油多少元? "],
         ["汽油每公升售12 \\frac{_1}{^2} 元,每升汽油", "可供小艇航行6 \\frac{_2}{^3} km \\circ ", "舅父駕小艇到海岸公園為保育", "計劃作資料搜集,共航行了", "9 \\frac{_1}{^3} km,他需汽油多少元? "]],
        //16 ans
        [["汽油每公升售20 \\frac{_1}{^4} 元,每升汽油", "可供小艇航行4 \\frac{_1}{^2} km \\circ ", "舅父駕小艇到海岸公園為保育", "計劃作資料搜集,共航行了", "8 \\frac{_4}{^5} km,他需汽油多少元? "],
         ["汽油每公升售12 \\frac{_1}{^2} 元,每升汽油", "可供小艇航行6 \\frac{_2}{^3} km \\circ ", "舅父駕小艇到海岸公園為保育", "計劃作資料搜集,共航行了", "9 \\frac{_1}{^3} km,他需汽油多少元? "]],
        //17
        [["餐館有2 \\frac{_5}{^6} kg藍莓和", "2 \\frac{_4}{^1^5} kg紅莓 \\circ 混合了的雜莓, ", "每1 \\frac{_1}{^5} kg可製作1L乳酪給", "慈善行的參加者 \\circ ", "餐館可提供雜莓乳酪多少L? "],
         ["餐館有1 \\frac{_5}{^6} kg藍莓和", "2 \\frac{_4}{^9} kg紅莓 \\circ 混合了的雜莓, ", "每1 \\frac{_1}{^6} kg可製作1L乳酪給", "慈善行的參加者 \\circ ", "餐館可提供雜莓乳酪多少L? ", ""]],
            //18 ans
            [["餐館有2 \\frac{_5}{^6} kg藍莓和", "2 \\frac{_4}{^1^5} kg紅莓 \\circ 混合了的雜莓, ", "每1 \\frac{_1}{^5} kg可製作1L乳酪給", "慈善行的參加者 \\circ ", "餐館可提供雜莓乳酪多少L? "],
            ["餐館有1 \\frac{_5}{^6} kg藍莓和", "2 \\frac{_4}{^9} kg紅莓 \\circ 混合了的雜莓, ", "每1 \\frac{_1}{^6} kg可製作1L乳酪給", "慈善行的參加者 \\circ ", "餐館可提供雜莓乳酪多少L? ", ""]],
         //final encouragement
        [["欣賞你今天所付出的努力!在過", "程中看見你不斷思考,不斷學", "習,我相信你在呈分試中會取得", "好成績!你也要相信自己做得到!", "我衷心祝福你在努力中充滿恩典!"],
         ["","","","",""],
         ["","","","",""]]]
    let answerFormat = [1,1,1,1,0, 1,0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 1]
    let blankAnswer: [[[[Double]]]] = [[[[2,1,2],[3,0,0],[3,13,24],[2,7,10]],
                                        [[3,1,2],[6,1,25],[3,203,320],[4,0,0]]],
                                       //2
        [[[8,1,2],[13,1,14],[8,6,7],[7,13,14]],
         [[5,9,10],[22,2,5],[6,19,35],[3,1,2]]],
        //3
        [[[0,7,10],[0,21,34],[9,27,32],[0,21,30]],
         [[1,1,4],[0,25,28],[20,5,6],[0,5,4]]],
        //4
        [[[14,3,10],[47,3,35],[5,7,10],[139,3,10]],
         [[17,1,5],[43,19,32],[8,4,5],[63,3,5]]],
        //5
        [[[0,0,0],[0,0,0],[0,0,0],[0,0,0]],
         [[0,0,0],[0,0,0],[0,0,0],[0,0,0]]],
        //6
        [[[3,0,0],[0,12,4],[4,1,8],[4,19,20]],
         [[2,0,0],[0,8,4],[4,1,3],[1,41,48]]],
        //7
        [[[0,0,0],[0,0,0],[0,0,0],[0,0,0]],
         [[0,0,0],[0,0,0],[0,0,0],[0,0,0]]],
        //8
        [[[56,0,0],[196,0,0],[55,5,9],[55,7,9]],
         [[48,0,0],[176,0,0],[47,4,7],[47,11,14]]],
        //9
        [[[0,0,0],[0,0,0],[0,0,0],[0,0,0]],
         [[0,0,0],[0,0,0],[0,0,0],[0,0,0]]],
        //10
        [[[980,0,0],[45,0,0],[245,0,0],[420,0,0]],
         [[600,0,0],[54,0,0],[225,0,0],[360,0,0]]],
        //11
        [[[0,0,0],[0,0,0],[0,0,0],[0,0,0]],
         [[0,0,0],[0,0,0],[0,0,0],[0,0,0]]],
        //12
        [[[5,1,5],[0,13,250],[332,4,5],[4,1,5]],
         [[6,0,0],[0,3,50],[216,0,0],[4,0,0]]],
        //13
        [[[0,0,0],[0,0,0],[0,0,0],[0,0,0]],
         [[0,0,0],[0,0,0],[0,0,0],[0,0,0]]],
        //14
        [[[340,0,0],[2,14,153],[183,14,17],[0,0,0]],
         [[360,0,0],[3,7,81],[160,0,0],[0,0,0]]],
        //15
        [[[0,0,0],[0,0,0],[0,0,0],[0,0,0]],
         [[0,0,0],[0,0,0],[0,0,0],[0,0,0]]],
        //16
        [[[39,3,5],[40,2,5],[0,45,88],[0,0,0]],
         [[17,1,2],[18,1,4],[0,45,224],[0,0,0]]],
        //17
        [[[0,0,0],[0,0,0],[0,0,0],[0,0,0]],
         [[0,0,0],[0,0,0],[0,0,0],[0,0,0]]],
        //18
        [[[4,1,4],[0,17,4],[4,3,12],[3,29,42]],
         [[3,2,3],[0,11,3],[3,14,21],[3,3,35]]]]
    
    let label5 = [["2 \\frac{1}{6} + \\frac{2}{3} \\div \\frac{4}{5} =",
                   "3 \\frac{2}{5} + \\frac{3}{8} \\div \\frac{5}{8} ="],
                  //2
        ["9 \\frac{1}{7} - \\frac{3}{7} \\times 1 \\frac{1}{2} =",
         "6 \\frac{3}{5} - \\frac{1}{5} \\times 3 \\frac{1}{2} ="],
        //3
        ["2 \\frac{5}{8} \\div (5-1 \\frac{1}{4} )=",
         "4 \\frac{1}{6} \\div (6-2 \\frac{2}{3} )= "],
        //4
        ["答案是",
         "答案是"],
        //5
        ["",
         ""],
        //6
        ["3 \\frac{3}{5} \\times \\frac{5}{8} + \\frac{3}{4} =",
         " \\frac{1}{4} +4 \\frac{1}{5} \\times \\frac{5}{12} ="],
        //7
        ["",
         ""],
        //8
        ["(85 \\frac{1}{2} + 40 \\frac{1}{2} ) \\times (1- \\frac{5}{9} )=",
         "(66 \\frac{3}{5} + 45 \\frac{2}{5} ) \\times (1- \\frac{4}{7} )="],
        //9
        ["",
         ""],
        //10
        ["210 \\div (1- \\frac{4}{7} - \\frac{3}{14} )=",
         "180 \\div (1- \\frac{2}{5} - \\frac{3}{10} )="],
        //11
        ["",
         ""],
        //12
        ["4 \\frac{4}{25} \\div 8 \\times 10=",
         "3 \\frac{3}{5} \\div 6 \\times 10="],
        //13
        ["",
         ""],
        //14
        ["250 \\div 9 \\frac{3}{8} \\times 12 \\frac{3}{4} =",
         "240 \\div 7 \\frac{1}{5} \\times 10 \\frac{4}{5} ="],
        //15
        ["",
         ""],
        //16
        ["20 \\frac{1}{4} \\div 4 \\frac{1}{2} \\times 8 \\frac{4}{5} =",
         "12 \\frac{1}{2} \\div 6 \\frac{2}{3} \\times 9 \\frac{1}{3} ="],
        //17
        ["",
         ""],
        //18
        ["(2 \\frac{5}{6} +2 \\frac{4}{15} ) \\div 1 \\frac{1}{5} =",
         "(1 \\frac{5}{6} +2 \\frac{4}{9} ) \\div 1 \\frac{1}{6} ="]]

    let answer = [[["", "", "", ""], ["", "", "", ""]],
                  //2
        [["", "", "", ""], ["", "", "", ""]],
        //3
        [["", "", "", ""], ["", "", "", ""]],
        //4
        [["", "", "", ""], ["", "", "", ""]],
        //5
        [["3 \\frac{3}{5} \\times \\frac{5}{8} + 4 \\frac{7}{10} \\times \\frac{3}{4} ",
          " \\frac{5}{8} + \\frac{3}{4} ",
          "3 \\frac{3}{5} \\times \\frac{5}{8} + \\frac{3}{4} ",
          "3 \\frac{3}{5} \\div \\frac{5}{8} + \\frac{3}{4} "],
         [" \\frac{1}{4} +4 \\frac{1}{5} \\div \\frac{5}{12} ",
          " \\frac{1}{4} +4 \\frac{1}{5} \\times \\frac{5}{12} ",
          "3 \\frac{1}{5} \\times \\frac{1}{4} +4 \\frac{1}{5} \\times \\frac{5}{12} ",
          " \\frac{1}{4} + \\frac{5}{12} "]],
        //6
        [["", "", "", ""], ["", "", "", ""]],
        //7
        [["(85 \\frac{1}{2} + 40 \\frac{1}{2} ) \\times (1- \\frac{5}{9} )",
          "(85 \\frac{1}{2} + 40 \\frac{1}{2} ) \\times \\frac{5}{9} ",
          "85 \\frac{1}{2} + 40 \\frac{1}{2} \\times (1- \\frac{5}{9} )",
          "85 \\frac{1}{2} + 40 \\frac{1}{2} \\times \\frac{5}{9} "],
         ["66 \\frac{3}{5} + 45 \\frac{2}{5} \\times (1- \\frac{4}{7} )",
          "66 \\frac{3}{5} + 45 \\frac{2}{5} \\times \\frac{4}{7} ",
          "(66 \\frac{3}{5} + 45 \\frac{2}{5} ) \\times (1- \\frac{4}{7} )",
          "(66 \\frac{3}{5} + 45 \\frac{2}{5} ) \\times \\frac{4}{7} "]],
        //8
        [["", "", "", ""], ["", "", "", ""]],
        //9
        [["210 \\div ( \\frac{4}{7} + \\frac{3}{14} )",
          "210 \\times ( \\frac{4}{7} + \\frac{3}{14} )",
          "210 \\div (1- \\frac{4}{7} - \\frac{3}{14} )",
          "210 \\times (1- \\frac{4}{7} - \\frac{3}{14} )"],
         ["180 \\times (1- \\frac{2}{5} - \\frac{3}{10} )",
          "180 \\div ( \\frac{2}{5} + \\frac{3}{10} )",
          "180 \\times ( \\frac{2}{5} + \\frac{3}{10} )",
          "180 \\div (1- \\frac{2}{5} - \\frac{3}{10} )"]],
        //10
        [["", "", "", ""], ["", "", "", ""]],
        //11
        [["8 \\div 4 \\frac{4}{25} \\times 10",
          "4 \\frac{4}{25} \\div 8 \\times 10",
          "4 \\frac{4}{25} \\times 8 \\div 10",
          "4 \\frac{4}{25} \\div 8 \\div 10"],
         ["3 \\frac{3}{5} \\times 6 \\div 10",
          "3 \\frac{3}{5} \\div 6 \\div 10",
          "3 \\frac{3}{5} \\div 6 \\times 10",
          "6 \\div 3 \\frac{3}{5} \\times 10"]],
        //12
        [["", "", "", ""], ["", "", "", ""]],
        //13
        [["250 \\div 9 \\frac{3}{8} \\times 12 \\frac{3}{4}",
          "9 \\frac{3}{8} \\div 250 \\times 12 \\frac{3}{4}",
          "250 \\times 9 \\frac{3}{8} \\div 12 \\frac{3}{4}",
          "250 \\div 9 \\frac{3}{8} \\div 12 \\frac{3}{4}"],
         ["7 \\frac{1}{5} \\div 240 \\times 10 \\frac{4}{5}",
          "240 \\times 7 \\frac{1}{5} \\div 10 \\frac{4}{5}",
          "240 \\div 7 \\frac{1}{5} \\div 10 \\frac{4}{5}",
          "240 \\div 7 \\frac{1}{5} \\times 10 \\frac{4}{5} "]],
        //14
        [["", "", "", ""], ["", "", "", ""]],
        //15
        [["4 \\frac{1}{2} \\div 20 \\frac{1}{4} \\times 8 \\frac{4}{5}",
          "20 \\frac{1}{4} \\times 4 \\frac{1}{2} \\div 8 \\frac{4}{5}",
          "20 \\frac{1}{4} -4 \\frac{1}{2} +8 \\frac{4}{5}",
          "20 \\frac{1}{4} \\div 4 \\frac{1}{2} \\times 8 \\frac{4}{5}"],
         ["12 \\frac{1}{2} \\times 6 \\frac{2}{3} \\div 9 \\frac{1}{3}",
          "6 \\frac{2}{3} \\div 12 \\frac{1}{2} \\times 9 \\frac{1}{3}",
          "12 \\frac{1}{2} \\div 6 \\frac{2}{3} \\times 9 \\frac{1}{3}",
          "12 \\frac{1}{2} -6 \\frac{2}{3} +9 \\frac{1}{3}"]],
        //16
        [["", "", "", ""], ["", "", "", ""]],
        //17
        [["2 \\frac{5}{6} +2 \\frac{4}{15} \\div 1 \\frac{1}{5}",
          "(2 \\frac{5}{6} +2 \\frac{4}{15} ) \\times 1 \\frac{1}{5}",
          "(2 \\frac{5}{6} +2 \\frac{4}{15} ) \\div 1 \\frac{1}{5} ",
          "2 \\frac{5}{6} +2 \\frac{4}{15} \\times 1 \\frac{1}{5}"],
         ["(1 \\frac{5}{6} +2 \\frac{4}{9} ) \\div 1 \\frac{1}{6} ",
          "1 \\frac{5}{6} +2 \\frac{4}{9} \\div 1 \\frac{1}{6}",
          "(1 \\frac{5}{6} +2 \\frac{4}{9} ) \\times 1 \\frac{1}{6}",
          "1 \\frac{5}{6} +2 \\frac{4}{9} \\times 1 \\frac{1}{6}"]],
        //18
        [["", "", "", ""], ["", "", "", ""]],
        //final encouragement
        [["細心閱讀題目", "熟練計算步驟", "信任自己", "常懷喜樂的心"]]]
    
    
    let response = [[[["欣賞你先計算除法才計算加法,", "而且你懂得把除數: \\div \\frac{_4}{^5} 上下倒轉:", " \\times \\frac{_5}{^4} \\circ 但要緊記同分母分數加法時,", "分母保持不變:2 \\frac{_1}{^6} + \\frac{_5}{^6} =2 \\frac{_6}{^6} \\circ ", "再算一算 \\circ",],
                      ["先計算除法才", "計算加法,算除法時先把除數: \\div \\frac{_4}{^5} ", "上下倒轉: \\times \\frac{_5}{^4} ,計算同分母分數加", "法時,分母保持不變:2 \\frac{_1}{^6} + \\frac{_5}{^6} =2 \\frac{_6}{^6} ", "=2+1,最後把 \\frac{_6}{^6}化成1 \\circ"],
                      ["你懂得用通分母來計算分數加法,", "也懂得把除數: \\div \\frac{_4}{^5} 上下倒轉: \\times \\frac{_5}{^4} \\circ ", "但要緊記先計算乘除數: \\frac{_2}{^3} \\div \\frac{_4}{^5} \\circ ", "相信你可以算出答案!", ""],
                      ["欣賞你先計算除法才計算加法,", "而且你懂得用通分母來計算分數", "加法 \\circ 但在計算除法時,記緊要", "把除數: \\div \\frac{_4}{^5} 上下倒轉: \\times \\frac{_5}{^4} \\circ ", "相信你會算出答案!"]],
                     [["欣賞你先計算除法才計算加法,", "而且你懂得把除數: \\div \\frac{_5}{^8} 上下倒轉:", " \\times \\frac{_8}{^5} \\circ 但要緊記同分母分數加法時,", "分母保持不變:3 \\frac{_2}{^5} + \\frac{_3}{^5} =3 \\frac{_5}{^5} \\circ ", "再算一算 \\circ",],
                      ["你懂得用通分母來計算分數加法,", "也懂得把除數: \\div \\frac{_5}{^8} 上下倒轉: \\times \\frac{_8}{^5} \\circ ", "但要緊記先計算乘除數: \\frac{_3}{^8} \\div \\frac{_5}{^8} \\circ ", "相信你可以算出答案!", ""],
                      ["欣賞你先計算除法才計算加法,", "而且你懂得用通分母來計算分數", "加法 \\circ 但在計算除法時,記緊要", "把除數: \\div \\frac{_5}{^8} 上下倒轉: \\times \\frac{_8}{^5} \\circ ", "相信你會算出答案!"],
                      ["先計算除法才", "計算加法,算除法時先把除數: \\div \\frac{_5}{^8} ", "上下倒轉: \\times \\frac{_8}{^5} ,計算同分母分數加", "法時,分母保持不變:3 \\frac{_2}{^5} + \\frac{_3}{^5} =3 \\frac{_5}{^5} ", "=3+1, 最後把 \\frac{_5}{^5}化成1 \\circ"]]],
                    //2
        [[["先計算乘法才", "計算減法,計算乘法前先把乘數:", "1 \\frac{_1}{^2} 化成假分數,然後運用通分母", "(分母=14)和退1(8 \\frac{_1_6}{^1^4} )來計算分", "數減法,最後把答案約至最簡 \\circ"],
          ["欣賞你懂得在計算分數乘法前,", "先把帶分數化成假分數 \\circ 緊記", "要先計算乘法( \\frac{_3}{^7} \\times 1 \\frac{_1}{^2} ),", "才計算減法(9 \\frac{_1}{^7} - \\frac{_9}{^1^4} ) \\circ", ""],
          ["欣賞你先計算乘法才計算減法,", "並計算乘法前先把乘數化成", "假分數,這時候不要把乘數 \\frac{_3}{^2} ", "上下倒轉,只有除法才這樣做 \\circ  ", ""],
          ["欣賞你先計算乘法才計算減法  \\circ ", "別忘計算乘法前先把乘數(1 \\frac{_1}{^2} )", "化成假分數(\\frac{_3}{^2} ),計算乘法後便", "運用通分母(7,14的L.C.M.是14)和", "退1(8 \\frac{_1_6}{^1^4} ) 來計算9 \\frac{_1}{^7} - \\frac{_9}{^1^4} \\circ  "]],
         [["先計算乘法才", "計算減法,計算乘法前先把乘數:", "3 \\frac{_1}{^2} 化成假分數,然後運用通分母", "(分母=10)和退1(5 \\frac{_1_6}{^1^0} )來計算分", "數減法,最後把答案約至最簡 \\circ"],
          ["欣賞你懂得在計算分數乘法前,", "先把帶分數化成假分數 \\circ 緊記", "要先計算乘法( \\frac{_1}{^5} \\times 3 \\frac{_1}{^2} ),", "才計算減法(6 \\frac{_3}{^5} - \\frac{_7}{^1^0} ) \\circ", ""],
          ["欣賞你先計算乘法才計算減法,", "並計算乘法前先把乘數化成", "假分數,這時候不要把乘數 \\frac{_7}{^2} ", "上下倒轉,只有除法才這樣做 \\circ  ", ""],
          ["欣賞你先計算乘法才計算減法 \\circ ", "別忘計算乘法前先把乘數(3 \\frac{_1}{^2} )", "化成假分數(\\frac{_7}{^2} ),計算乘法後便", "運用通分母(5,10的L.C.M.是10)和", "退1(5   \\frac{_1_6}{^1^0} ) 來計算6 \\frac{_3}{^5} - \\frac{_7}{^1^0} \\circ "]]],
        //3
        [[["先把5退1(4 \\frac{_4}{^4} )", "來計算括號內的減法,然後計算", "除法前先把被除數和除數都化成", "假分數,並把除數上下倒轉( \\times \\frac{_4}{^1^5}),", "最後把答案約至最簡 \\circ "],
          ["欣賞你計算除法前先把被除數和", "除數都化成假分數,並把除數", "上下倒轉 \\circ 要緊記5-1 \\frac{_1}{^4} 要先退1:", "4 \\frac{_4}{^4} -1 \\frac{_1}{^4} ,這樣,被減數的分數部份", "才有足夠的數量進行減法 \\circ"],
          ["欣賞你能退1來計算分數減法,", "並懂得計算除法前先把被除數", "和除數都化成假分數,這時候,", "別忘把除數( \\div \\frac{_1_5}{^4} )上下倒轉( \\times \\frac{_4}{^1^5} ),", "這樣你便能算出答案!"],
          ["你懂得很多計算法則!你能退1來", "計算分數減法,又能把被除數", "和除數先化成假分數,並把", "除數上下倒轉 \\circ 這時候,", "除了4,8可約簡,21,15也可除以3 \\circ"]],
         [["先把6退1(5 \\frac{_3}{^3} )", "來計算括號內的減法,然後計算", "除法前先把被除數和除數都化成", "假分數,並把除數上下倒轉( \\times \\frac{_3}{^1^0}),", "最後把答案約至最簡 \\circ "],
          ["欣賞你計算除法前先把被除數和", "除數都化成假分數,並把除數", "上下倒轉 \\circ 要緊記6-2 \\frac{_2}{^3} 要先退1:", "5 \\frac{_3}{^3} -2 \\frac{_2}{^3} ,這樣,被減數的分數部份", "才有足夠的數量進行減法 \\circ"],
          ["欣賞你能退1來計算分數減法,", "並懂得計算除法前先把被除數", "和除數都化成假分數,這時候,", "別忘把除數( \\div \\frac{_1_0}{^3} )上下倒轉( \\times \\frac{_3}{^1^0} ),", "這樣你便能算出答案!"],
          ["你懂得很多計算法則!你能退1來", "計算分數減法,又能把被除數", "和除數先化成假分數,並把除數", "上下倒轉及約至最簡 \\circ 這時候,", "把答案化成帶分數便會成功 \\circ"]]],
        //4
        [[["先正確列寫", "算式:50-10 \\frac{_1}{^5} \\times 3 \\frac{_1}{^2} ,", "並以假分數先計算乘法( \\frac{_5_1}{^5} \\times \\frac{_7}{^2} ),", "最後以退1(49 \\frac{_1_0}{^1^0} )來計算分數減法 \\circ ", ""],
          ["欣賞你能正確列寫算式:", "50-10 \\frac{_1}{^5} \\times 3 \\frac{_1}{^2} ,", "並以假分數先計算乘法( \\frac{_5_1}{^5} \\times \\frac{_7}{^2} ),", "但不用把乘數( \\times \\frac{_7}{^2} )上下倒轉 \\circ", ""],
          ["欣賞你能正確列寫算式:", "50-10 \\frac{_1}{^5} \\times 3 \\frac{_1}{^2} ,", "並以假分數先計算乘法( \\frac{_5_1}{^5} \\times \\frac{_7}{^2} ),", "別忘50要退1(49 \\frac{_1_0}{^1^0} ),被減數的分", "數部份才有足夠的數量進行減法 \\circ"],
          ["欣賞你能正確列寫算式:", "50-10 \\frac{_1}{^5} \\times 3 \\frac{_1}{^2} ,", "並懂得以退1來計算減法,又能以", "假分數來計算乘法 \\circ 緊記要先計算", "乘法(10 \\frac{_1}{^5} \\times 3 \\frac{_1}{^2} )才計算減法 \\circ "]],
         [["先正確列寫", "算式:50-10 \\frac{_1}{^4} \\times 3 \\frac{_1}{^5} ,", "並以假分數先計算乘法( \\frac{_4_1}{^4} \\times \\frac{_1_6}{^5} ),", "最後以退1(49 \\frac{_5}{^5} )來計算分數減法 \\circ ", ""],
          ["欣賞你能正確列寫算式:", "50-10 \\frac{_1}{^4} \\times 3 \\frac{_1}{^5} ,", "並以假分數先計算乘法( \\frac{_4_1}{^4} \\times \\frac{_1_6}{^5} ),", "但不用把乘數( \\times \\frac{_1_6}{^5} )上下倒轉 \\circ", ""],
          ["欣賞你能正確列寫算式:", "50-10 \\frac{_1}{^4} \\times 3 \\frac{_1}{^5} ,", "並以假分數先計算乘法( \\frac{_4_1}{^4} \\times \\frac{_1_6}{^5} ),", "別忘50要退1 (49 \\frac{_5}{^5} ),被減數的分", "數部份才有足夠的數量進行減法 \\circ"],
          ["欣賞你能正確列寫算式:", "50-10 \\frac{_1}{^4} \\times 3 \\frac{_1}{^5} ,", "並懂得以退1來計算減法,又能以", "假分數來計算乘法 \\circ 緊記要先計算", "乘法(10 \\frac{_1}{^4} \\times 3 \\frac{_1}{^5} )才計算減法 \\circ "]]],
        //5
        [[["欣賞你仍記得分數乘法的意義,", "明白3 \\frac{_3}{^5} 米的 \\frac{_5}{^8}即是3 \\frac{_3}{^5} 米   \\times \\frac{_5}{^8} \\circ ", "但是4 \\frac{_7}{^1^0} 米的其中 \\frac{_3}{^4} \\color{#ff0000}{米}", "其實即是 \\frac{_3}{^4} \\color{#ff0000}{米} \\circ  ", ""],
          ["你會細心判斷4 \\frac{_7}{^1^0} 米的其中 \\frac{_3}{^4} \\color{#ff0000}{米} ", "即是 \\frac{_3}{^4} \\color{#ff0000}{米},這是正確的  \\circ ", "但是 3 \\frac{_3}{^5} 米的 \\frac{_5}{^8}需用乘法:", "即是3 \\frac{_3}{^5} 米 \\times \\frac{_5}{^8} \\circ ", ""],
          ["這是正確的算式!欣賞你", "仔細閱讀題目,並能理解3 \\frac{_3}{^5} 米的 \\frac{_5}{^8} ", "即是3 \\frac{_3}{^5} 米   \\times \\frac{_5}{^8} ,", "而4 \\frac{_7}{^1^0} 米的其中 \\frac{_3}{^4} \\color{#ff0000}{米} 即是 \\frac{_3}{^4} \\color{#ff0000}{米} \\circ  ", ""],
          ["你會細心觀察4 \\frac{_7}{^1^0} 米的其中 \\frac{_3}{^4} \\color{#ff0000}{米} ", "其實即是 \\frac{_3}{^4} \\color{#ff0000}{米},這是正確的  \\circ ", "但是 3 \\frac{_3}{^5} 米的 \\frac{_5}{^8}需用乘法:", "即是3 \\frac{_3}{^5} 米 \\times \\frac{_5}{^8} \\circ ", ""]],
         [["你會細心觀察3 \\frac{_1}{^5} 米的其中 \\frac{_1}{^4} \\color{#ff0000}{米} ", "其實即是 \\frac{_1}{^4} \\color{#ff0000}{米},這是正確的  \\circ ", "但是4 \\frac{_1}{^5} 米的 \\frac{_5}{^1^2}需用乘法:", "即是4 \\frac{_1}{^5} 米 \\times \\frac{_5}{^1^2} \\circ ", ""],
          ["這是正確的算式!欣賞你", "仔細閱讀題目,並能理解4 \\frac{_1}{^5} 米的 \\frac{_5}{^1^2} ", "即是4 \\frac{_1}{^5} 米   \\times \\frac{_5}{^1^2} ,", "而3 \\frac{_1}{^5} 米的其中 \\frac{_1}{^4} \\color{#ff0000}{米} 即是 \\frac{_1}{^4} \\color{#ff0000}{米} \\circ  ", ""],
          ["欣賞你仍記得分數乘法的意義,", "明白4 \\frac{_1}{^5} 米的 \\frac{_5}{^1^2}即是4 \\frac{_1}{^5} 米   \\times \\frac{_5}{^1^2} \\circ ", "但是3 \\frac{_1}{^5} 米的其中 \\frac{_1}{^4} \\color{#ff0000}{米} ", "其實即是 \\frac{_1}{^4} \\color{#ff0000}{米} \\circ  ", ""],
          ["你會細心判斷3 \\frac{_1}{^5} 米的其中 \\frac{_1}{^4} \\color{#ff0000}{米} ", "即是 \\frac{_1}{^4} \\color{#ff0000}{米},這是正確的  \\circ ", "但是 4 \\frac{_1}{^5} 米的 \\frac{_5}{^1^2}需用乘法:", "即是4 \\frac{_1}{^5} 米   \\times \\frac{_5}{^1^2} \\circ ", ""]]],
        //6
        [[["先計算乘法才", "計算加法,計算乘法時先把3 \\frac{_3}{^5} ", "化成假分數,約至最簡後,剛好是", "同分母加法,得到一個假分數時,", "需分子除以分母來得到答案 \\circ"],
          ["欣賞你先計算乘法才計算加法,", "計算乘法時能先把3 \\frac{_3}{^5} 化成假分數,", "約至最簡後,進行同分母加法 \\circ ", "這時得到一個假分數,需分子", "除以分母來得到一個整數的答案 \\circ"],
          ["欣賞你先計算乘法才計算加法 \\circ ", "留意計算乘法時先把3 \\frac{_3}{^5} ", "化成假分數, ", "相信你會算出答案!", ""],
          ["欣賞你懂得計算乘法時先把3 \\frac{_3}{^5} ", "化成假分數,又會約至最簡 \\circ ", "緊記先計算乘法(3 \\frac{_3}{^5} \\times \\frac{_5}{^8} ),", "才計算加法 \\circ ", ""]],
         [["先計算乘法才", "計算加法,計算乘法時先把4 \\frac{_1}{^5} ", "化成假分數,約至最簡後,剛好是", "同分母加法,得到一個假分數時,", "需分子除以分母來得到答案 \\circ"],
          ["欣賞你先計算乘法才計算加法,", "計算乘法時能先把4 \\frac{_1}{^5} 化成假分數,", "約至最簡後,進行同分母加法 \\circ ", "這時得到一個假分數,需分子", "除以分母來得到一個整數的答案 \\circ"],
          ["欣賞你先計算乘法才計算加法 \\circ ", "留意計算乘法時先把4 \\frac{_1}{^5} ", "化成假分數, ", "相信你會算出答案!", ""],
          ["欣賞你懂得以假分數計算乘法,", "又會約至最簡 \\circ ", "緊記先計算乘法(4 \\frac{_1}{^5} \\times \\frac{_5}{^1^2} ),", "才計算加法 \\circ ", ""]]],
        //7
        [[["這是正確的算式!欣賞你能理解", "糖果和巧克力都取去 \\frac{_5}{^9} ,所以先", "用加法和括號去計算它們重量的", "總和 \\circ 各取去\\frac{_5}{^9} ,即各餘下", " ( \\frac{_9}{^9} - \\frac{_5}{^9} ),即(1- \\frac{_5}{^9} ) \\circ "],
          ["欣賞你能理解糖果和巧克力都", "取去 \\frac{_5}{^9} ,所以先用加法和括號去", "計算它們重量的總和 \\circ ", "不過,不是各餘下 \\frac{_5}{^9} , ", "而是各餘下( \\frac{_9}{^9} - \\frac{_5}{^9} ),即(1- \\frac{_5}{^9} ) \\circ "],
          ["欣賞你能運用(1- \\frac{_5}{^9} )來計算糖果", "和巧克力各餘下 \\frac{_4}{^9} \\circ 但是, ", "它們的總重量在乘以\\frac{_4}{^9} 前, ", "需用括號來表示它們的重量", "要先相加 \\circ"],
          ["欣賞你懂得運用乘法來計算糖果", "和巧克力的一部份 \\circ ", "不過,需用括號來表示它們的重量", "要先相加,而且不是各餘下 \\frac{_5}{^9} , ", "而是各餘下( \\frac{_9}{^9} - \\frac{_5}{^9} ),即(1- \\frac{_5}{^9} ) \\circ"]],
         [["欣賞你能運用(1- \\frac{_4}{^7} )來計算糖果", "和巧克力各餘下 \\frac{_3}{^7} \\circ 但是, ", "它們的總重量在乘以\\frac{_3}{^7} 前, ", "需用括號來表示它們的重量", "要先相加 \\circ"],
          ["欣賞你懂得運用乘法來計算糖果", "和巧克力的一部份 \\circ ", "不過,需用括號來表示它們的重量", "要先相加,而且不是各餘下 \\frac{_4}{^7} , ", "而是各餘下( \\frac{_7}{^7} - \\frac{_4}{^7} ),即(1- \\frac{_4}{^7} ) \\circ"],
          ["這是正確的算式!欣賞你能理解", "糖果和巧克力都取去 \\frac{_4}{^7} ,所以先", "用加法和括號去計算它們重量的", "總和 \\circ 各取去\\frac{_4}{^7} ,即各餘下", " ( \\frac{_7}{^7} - \\frac{_4}{^7} ),即(1- \\frac{_4}{^7} ) \\circ "],
          ["欣賞你能理解糖果和巧克力都", "取去 \\frac{_4}{^7} ,所以先用加法和括號去", "計算它們重量的總和 \\circ ", "不過,不是各餘下 \\frac{_4}{^7} , ", "而是各餘下( \\frac{_7}{^7} - \\frac{_4}{^7} ),即(1- \\frac{_4}{^7} ) \\circ"]]],
        //8 ans
        [[["在計算糖果和", "巧克力的總重量時,把125 \\frac{_2}{^2} ", "的 \\frac{_2}{^2} 進1至整數,並在計算", " (1- \\frac{_5}{^9} )時,把1退成 \\frac{_9}{^9} , ", "在約簡時,把126,9都除以9 \\circ "],
          ["欣賞你懂得把125 \\frac{_2}{^2} 的 \\frac{_2}{^2} 進1至", "整數 \\circ 要留意在計算(1- \\frac{_5}{^9} )時, ", "需把1退成 \\frac{_9}{^9} ,得到的差是一個", "真分數,而不是帶分數 \\circ", ""],
          ["欣賞你能夠在計算(1- \\frac{_5}{^9} )時, ", "把1退成 \\frac{_9}{^9} \\circ 但別忘在計算糖果和", "巧克力的總重量時, ", "把125 \\frac{_2}{^2} 的 \\frac{_2}{^2} 進1", "至整數:125->126 \\circ "],
          ["欣賞你能夠在計算(1- \\frac{_5}{^9} )時, ", "把1退成 \\frac{_9}{^9} \\circ 但小心在計算", " \\frac{_1}{^2} + \\frac{_1}{^2} 時不可改變分母, ", "所以應得到 \\frac{_2}{^2} , ", "而不是\\frac{_2}{^4} \\circ "]],
         [["在計算糖果和", "巧克力的總重量時,把111 \\frac{_5}{^5} ", "的 \\frac{_5}{^5} 進1至整數,並在計算", " (1- \\frac{_4}{^7} )時,把1退成 \\frac{_7}{^7} , ", "在約簡時,把112,7都除以7 \\circ "],
          ["欣賞你懂得把111 \\frac{_5}{^5} 的 \\frac{_5}{^5} 進1至", "整數 \\circ 要留意在計算(1- \\frac{_4}{^7} )時, ", "需把1退成 \\frac{_7}{^7} ,得到的差是一個", "真分數,而不是帶分數 \\circ", ""],
          ["欣賞你能夠在計算(1- \\frac{_4}{^7} )時, ", "把1退成 \\frac{_7}{^7} \\circ 但別忘在計算糖果和", "巧克力的總重量時, ", "把111 \\frac{_5}{^5} 的 \\frac{_5}{^5} 進1", "至整數:111->112 \\circ "],
          ["欣賞你能夠在計算(1- \\frac{_4}{^7} )時, ", "把1退成 \\frac{_7}{^7} \\circ 但小心在計算", " \\frac{_3}{^5} + \\frac{_2}{^5} 時不可改變分母, ", "所以應得到 \\frac{_5}{^5} , ", "而不是\\frac{_5}{^1^0} \\circ "]]],
        //9
        [[["欣賞你懂得用除法去求師生人數, ", "所有師生 \\times 男生佔的分數=210 \\circ ", "但是男生所佔的分數應是", "全部師生佔的分數 \\frac{_1_4}{^1^4} 即1, ", "減去 \\frac{_4}{^7} 和 \\frac{_3}{^1^4} \\circ "],
          ["試運用全部師生佔的分數 \\frac{_1_4}{^1^4} 即1, ", "先求得男生所佔的分數, ", "然後運用方程: ", "所有師生 \\times 男生佔的分數=210, ", "便能寫出求全部師生的算式 \\circ"],
          ["正確!欣賞你先運用女生佔 \\frac{_4}{^7} ", "和教師佔 \\frac{_3}{^1^4},來得出男生佔", " (1- \\frac{_4}{^7} - \\frac{_3}{^1^4} ),再運用方程: ", "所有師生 \\times 男生佔的分數=210, ", "便能以除法求得師生人數 \\circ"],
          ["欣賞你運用女生佔 \\frac{_4}{^7} 和教師佔 \\frac{_3}{^1^4},", "來得出男生佔(1- \\frac{_4}{^7} - \\frac{_3}{^1^4} ) \\circ ", "之後要運用方程: ", "所有師生 \\times 男生佔的分數=210, ", "最後要算出師生人數應用除法 \\circ"]],
         [["欣賞你運用女生佔 \\frac{_2}{^5} 和教師佔 \\frac{_3}{^1^0},", "來得出男生佔(1- \\frac{_2}{^5} - \\frac{_3}{^1^0} ) \\circ ", "之後要運用方程: ", "所有師生 \\times 男生佔的分數=180, ", "最後要算出師生人數應用除法 \\circ"],
          ["欣賞你懂得用除法去求師生人數, ", "所有師生 \\times 男生佔的分數=180 \\circ ", "但是男生所佔的分數應是", "全部師生佔的分數 \\frac{_1_0}{^1^0} 即1, ", "減去 \\frac{_2}{^5} 和 \\frac{_3}{^1^0} \\circ "],
          ["試運用全部師生佔的分數 \\frac{_1_0}{^1^0} 即1, ", "先求得男生所佔的分數, ", "然後運用方程: ", "所有師生 \\times 男生佔的分數=180, ", "便能寫出求全部師生的算式 \\circ"],
          ["正確!欣賞你先運用女生佔 \\frac{_2}{^5} ", "和教師佔 \\frac{_3}{^1^0},來得出男生佔", " (1- \\frac{_2}{^5} - \\frac{_3}{^1^0} ),再運用方程: ", "所有師生 \\times 男生佔的分數=180, ", "便能以除法求得師生人數 \\circ"]]],
        //10 ans
        [[["先通分母: ", " \\frac{_4}{^7} -> \\frac{ \\color{#ff0000}{_8}}{^1^4} ,並退1成 \\frac{ \\color{#007000}{_1_4}}{^1^4} , ", "才計算減法 \\frac{ \\color{#007000}{_1_4} _- \\color{#ff0000}{_8} _-_3}{^1^4} \\circ 計算除法時", "也先把除數: \\div \\frac{_3}{^1^4} 上下倒轉: \\times \\frac{_1_4}{^3} , ", "最後約簡便能算出答案 \\circ"],
          ["欣賞你懂得先通分母: \\frac{_4}{^7} -> \\frac{_8}{^1^4} , ", "並退1成 \\frac{_1_4}{^1^4} ,才計算減法 \\frac{_1_4_-_8_-_3}{^1^4} \\circ ", "留意計算除法時先把除數: \\div \\frac{ \\color{#ff0000}{_3}}{ \\color{#007000}{^1^4}} ", "上下倒轉: \\times \\frac{ \\color{#007000}{_1_4}}{ \\color{#ff0000}{^3}} , ", "相信你能夠算出答案!"],
          ["在計算1- \\frac{_4}{^7} - \\frac{_3}{^1^4} 時,只得1是", "被減數,所以要先退1成 \\frac{ \\color{#007000}{_1_4}}{^1^4} , ", "並通分母: \\frac{_4}{^7} -> \\frac{ \\color{#ff0000}{_8}}{^1^4} , ", "這時便能計算同分母減法: ", " \\frac{ \\color{#007000}{_1_4} _- \\color{#ff0000}{_8} _-_3}{^1^4} \\circ "],
          ["欣賞你懂得先退1成 \\frac{ \\color{#007000}{_1_4}}{^1^4} , ", "別忘同時要通分母: \\frac{_4}{^7} -> \\frac{ \\color{#ff0000}{_8}}{^1^4} , ", "這時便能計算同分母減法: ", " \\frac{ \\color{#007000}{_1_4} _- \\color{#ff0000}{_8} _-_3}{^1^4} \\circ ", ""]],
         [["先通分母:", " \\frac{_2}{^5} -> \\frac{ \\color{#ff0000}{_4}}{^1^0} ,並退1成 \\frac{_ \\color{#007000}{_1_0}}{^1^0} , ", "才計算減法 \\frac{ \\color{#007000}{_1_0} _- \\color{#ff0000}{_4} _-_3}{^1^0} \\circ 計算除法時", "也先把除數: \\div \\frac{_3}{^1^0} 上下倒轉: \\times \\frac{_1_0}{^3} , ", "最後約簡便能算出答案 \\circ"],
          ["欣賞你懂得先通分母: \\frac{_2}{^5} -> \\frac{_4}{^1^0} , ", "並退1成 \\frac{_1_0}{^1^0} ,才計算減法 \\frac{_1_0_-_4_-_3}{^1^0} \\circ ", "留意計算除法時先把除數: \\div \\frac{ \\color{#ff0000}{_3}}{ \\color{#007000}{^1^0}} ", "上下倒轉: \\times \\frac{ \\color{#007000}{_1_0}}{ \\color{#ff0000}{^3}} , ", "相信你能夠算出答案!"],
          ["在計算1- \\frac{_2}{^5} - \\frac{_3}{^1^0} 時,只得1是", "被減數,所以要先退1成 \\frac{ \\color{#007000}{_1_0}}{^1^0} , ", "並通分母: \\frac{_2}{^5} -> \\frac{ \\color{#ff0000}{_4}}{^1^0} , ", "這時便能計算同分母減法: ", " \\frac{ \\color{#007000}{_1_0} _- \\color{#ff0000}{_4} _-_3}{^1^0} \\circ "],
          ["欣賞你懂得先退1成 \\frac{ \\color{#007000}{_1_0}}{^1^0} , ", "別忘同時要通分母: \\frac{_2}{^5} -> \\frac{ \\color{#ff0000}{_4}}{^1^0} , ", "這時便能計算同分母減法: ", " \\frac{ \\color{#007000}{_1_0} _- \\color{#ff0000}{_4} _-_3}{^1^0} \\circ ", ""]]],
        //11
        [[["要求得10本歌書的重量前, ", "應先求得1本歌書的重量, ", "這時候,要把8本歌書的重量", "4 \\frac{_4}{^2^5} 除以8, ", "便可算出1本的重量 \\circ"],
          ["做得好!你能運用4 \\frac{_4}{^2^5} \\div 8", "先得出1本歌書的重量, ", "再以乘法求出", "10本歌書的重量 \\circ", ""],
          ["4 \\frac{_4}{^2^5} kg是8本歌書的重量, ", "4 \\frac{_4}{^2^5} \\times 8是甚麼?就是64本", "歌書的重量!請用4 \\frac{_4}{^2^5} \\div 8來求", "1本歌書的重量, ", "再計算10本歌書的重量 \\circ"],
          ["欣賞你能運用4 \\frac{_4}{^2^5} \\div 8先得出", "1本歌書的重量 \\circ ", "不過,之後要用甚麼方法求得", "10本歌書的重量? ", ""]],
         [["3 \\frac{_3}{^5} kg是6本歌書的重量, ", "3 \\frac{_3}{^5} \\times 6是甚麼?就是36本", "歌書的重量!請用3 \\frac{_3}{^5} \\div 6來求", "1本歌書的重量, ", "再計算10本歌書的重量 \\circ"],
          ["欣賞你能運用3 \\frac{_3}{^5} \\div 6先得出", "1本歌書的重量 \\circ ", "不過,之後要用甚麼方法求得", "10本歌書的重量? ", ""],
          ["做得好!你能運用3 \\frac{_3}{^5} \\div 6", "先得出1本歌書的重量, ", "再以乘法求出", "10本歌書的重量 \\circ", ""],
          ["要求得10本歌書的重量前, ", "應先求得1本歌書的重量, ", "這時候,要把6本歌書的重量", "3 \\frac{_3}{^5} 除以6, ", "便可算出1本的重量 \\circ"]]],
        //12 ans
        [[["在乘除混合計算", "中由左至右計算,同時,把4 \\frac{_4}{^2^5} 化成", "假分數及把 \\div 8上下倒轉成 \\times \\frac{_1}{^8} , ", "約至最簡後便得到正確答案 \\circ ", ""],
          ["欣賞你先把4 \\frac{_4}{^2^5} 化成假分數 \\circ ", "但在乘除混合計算中, ", "緊記要順序由左至右計算, ", "不能先計算8 \\times 10, ", "應先計算4 \\frac{_4}{^2^5} \\div 8 \\circ"],
          ["欣賞你先把4 \\frac{_4}{^2^5} 化成假分數 \\circ ", "小心在計算4 \\frac{_4}{^2^5} \\div 8時要把", " \\div 8上下倒轉成 \\times \\frac{_1}{^8} , ", "才以分數乘法計算答案 \\circ ", ""],
          ["欣賞你懂得在計算4 \\frac{_4}{^2^5} \\div 8時把", " \\div 8上下倒轉成 \\times \\frac{_1}{^8} \\circ ", "但這時候,也需要把", "4 \\frac{_4}{^2^5} 化成假分數 \\frac{_1_0_4}{^2^5} \\circ ", ""]],
         [["在乘除混合計算中", "由左至右計算,同時,把3 \\frac{_3}{^5} 化成", "假分數及把 \\div 6上下倒轉成 \\times \\frac{_1}{^6} , ", "約至最簡後便得到正確答案 \\circ ", ""],
          ["欣賞你先把3 \\frac{_3}{^5} 化成假分數 \\circ ", "但在乘除混合計算中, ", "緊記要順序由左至右計算, ", "不能先計算6 \\times 10, ", "應先計算3 \\frac{_3}{^5} \\div 6 \\circ"],
          ["欣賞你先把3 \\frac{_3}{^5} 化成假分數 \\circ ", "小心在計算3 \\frac{_3}{^5} \\div 6時要把", " \\div 6上下倒轉成 \\times \\frac{_1}{^6} , ", "才以分數乘法計算答案 \\circ ", ""],
          ["欣賞你懂得在計算3 \\frac{_3}{^5} \\div 6時把", " \\div 6上下倒轉成 \\times \\frac{_1}{^6} \\circ ", "但這時候,也需要把", "3 \\frac{_3}{^5} 化成假分數 \\frac{_1_8}{^5} \\circ ", ""]]],
        //13
        [[["勁!這是正確的算式!首先用", "9 \\frac{_3}{^8} kg麪包的價錢250元來", "除以9 \\frac{_3}{^8} ,求得1kg的價錢, ", "最後以乘法來計算", "12 \\frac{_3}{^4} kg麪包的價錢 \\circ "],
          ["在乘以12 \\frac{_3}{^4}來求得12 \\frac{_3}{^4}kg麪包", "的價錢前,要先求得1kg的價錢, ", "這就需用9 \\frac{_3}{^8} kg麪包的價錢250元", "來除以9 \\frac{_3}{^8} \\circ ", ""],
          ["250元是9 \\frac{_3}{^8} kg麪包的價錢, ", "應先用除法求得1kg的價錢, ", "再以乘法來計算", "12 \\frac{_3}{^4} kg麪包的價錢 \\circ", ""],
          ["欣賞你懂得用250除以9 \\frac{_3}{^8} ", "來求得1kg麪包的價錢 \\circ ", "再用1kg的價錢來計算", "12 \\frac{_3}{^4} kg的價錢應該用甚麼方法? ", ""]],
         [["在乘以10 \\frac{_4}{^5}來求得10 \\frac{_4}{^5}kg麪包", "的價錢前,要先求得1kg的價錢, ", "這就需用7 \\frac{_1}{^5} kg麪包的價錢240元", "來除以7 \\frac{_1}{^5} \\circ ", ""],
          ["240元是7 \\frac{_1}{^5} kg麪包的價錢, ", "應先用除法求得1kg的價錢, ", "再以乘法來計算", "10 \\frac{_4}{^5} kg麪包的價錢 \\circ", ""],
          ["欣賞你懂得用240除以7 \\frac{_1}{^5} ", "來求得1kg麪包的價錢 \\circ ", "再用1kg的價錢來計算", "10 \\frac{_4}{^5} kg的價錢應該用甚麼方法? ", ""],
          ["勁!這是正確的算式!首先用", "7 \\frac{_1}{^5} kg麪包的價錢240元來", "除以7 \\frac{_1}{^5} ,求得1kg的價錢, ", "最後以乘法來計算", "10 \\frac{_4}{^5} kg麪包的價錢 \\circ "]]],
        //14 ans
        [[["在乘除計算中, ", "先把9 \\frac{_3}{^8} 和12 \\frac{_3}{^4} 化成假分數, ", "然後把 \\div \\frac{_7_5}{^8} 上下倒轉成 \\times \\frac{_8}{^7^5} , ", "最後計算連乘法和約至最簡", "來求得答案 \\circ"],
          ["在乘除混合計算中, ", "並不是先計算乘法, ", "而是由左至右順序計算, ", "所以這兒應先計算250 \\div 9 \\frac{_3}{^8} \\circ ", "相信你可以算出正確答案!"],
          ["欣賞你在計算分數乘除前把", "帶分數化成假分數 \\circ 這時候, ", "乘數 \\times \\frac{_5_1}{^4} 不需要上下倒轉, ", "只有除數 \\div \\frac{_7_5}{^8} 才需要", "上下倒轉成 \\times \\frac{_8}{^7^5} \\circ"],
          ["在乘除混合計算中, ", "先把9 \\frac{_3}{^8} 和12 \\frac{_3}{^4} 化成假分數, ", "然後把 \\div \\frac{_7_5}{^8} 上下倒轉成 \\times \\frac{_8}{^7^5} , ", "最後計算連乘法和約至最簡", "來求得答案 \\circ"]],
         [["在乘除計算中, ", "先把7 \\frac{_1}{^5} 和10 \\frac{_4}{^5} 化成假分數, ", "然後把 \\div \\frac{_3_6}{^5} 上下倒轉成 \\times \\frac{_5}{^3^6} , ", "最後計算連乘法和約至最簡", "來求得答案 \\circ"],
          ["在乘除混合計算中, ", "並不是先計算乘法, ", "而是由左至右順序計算, ", "所以這兒應先計算240 \\div 7 \\frac{_1}{^5} \\circ ", "相信你可以算出正確答案!"],
          ["欣賞你在計算分數乘除前把", "帶分數化成假分數 \\circ 這時候, ", "乘數 \\times \\frac{_5_4}{^5} 不需要上下倒轉, ", "只有除數 \\div \\frac{_3_6}{^5} 才需要", "上下倒轉成 \\times \\frac{_5}{^3^6} \\circ"],
          ["在乘除混合計算中, ", "先把7 \\frac{_1}{^5} 和10 \\frac{_4}{^5} 化成假分數, ", "然後把 \\div \\frac{_3_6}{^5} 上下倒轉成 \\times \\frac{_5}{^3^6} , ", "最後計算連乘法和約至最簡", "來求得答案 \\circ"]]],
        //15
        [[["題目首兩句透過每升汽油間接", "表達20 \\frac{_1}{^4} 元汽油可航行4 \\frac{_1}{^2} km,", "所以小心求航行每1km所需要的", "應是(20 \\frac{_1}{^4} \\div 4 \\frac{_1}{^2} )元汽油 \\circ ", ""],
          ["題目首兩句透過每升汽油間接", "表達20 \\frac{_1}{^4} 元汽油可航行4 \\frac{_1}{^2} km, ", "所以要先以除法得出航行1km", "需要汽油多少元, 再以乘法", "求得8 \\frac{_4}{^5} km所需要的 \\circ "],
          ["航行4 \\frac{_1}{^2} km並不表示用去4 \\frac{_1}{^2} 元", "汽油 \\circ 試用除法先求得", "航行1km需要汽油多少元 \\circ ", "你的努力將會結出好果實!", ""],
          ["正確!題目首兩句透過每升汽油", "間接表達20 \\frac{_1}{^4} 元汽油可航行", "4 \\frac{_1}{^2} km, 所以每1km需要", " (20 \\frac{_1}{^4} \\div 4 \\frac{_1}{^2} )元汽油,然後再以", "乘法求得8 \\frac{_4}{^5} km所需要的 \\circ"]],
         [["題目首兩句透過每升汽油間接", "表達12 \\frac{_1}{^2} 元汽油可航行6 \\frac{_2}{^3} km, ", "所以要先以除法得出航行1km", "需要汽油多少元, 再以乘法", "求得9 \\frac{_1}{^3} km所需要的 \\circ "],
          ["題目首兩句透過每升汽油間接", "表達12 \\frac{_1}{^2} 元汽油可航行6 \\frac{_2}{^3} km,", "所以小心求航行每1km所需要的", "應是(12 \\frac{_1}{^2} \\div 6 \\frac{_2}{^3} )元汽油 \\circ ", ""],
          ["正確!題目首兩句透過每升汽油", "間接表達12 \\frac{_1}{^2} 元汽油可航行", "6 \\frac{_2}{^3} km, 所以每1km需要", " (12 \\frac{_1}{^2} \\div 6 \\frac{_2}{^3} )元汽油,然後再以", "乘法求得9 \\frac{_1}{^3} km所需要的 \\circ"],
          ["航行6 \\frac{_2}{^3} km並不表示用去6 \\frac{_2}{^3} 元", "汽油 \\circ 試用除法先求得", "航行1km需要汽油多少元 \\circ ", "你的努力將會結出好果實!", ""]]],
        //16 ans
        [[["先把三個", "帶分數都化成假分數,然後把", "除數 \\div \\frac{_9}{^2} 上下倒轉成 \\times \\frac{_2}{^9} , ", "最後以連乘法及約簡", "來求得正確答案 \\circ"],
          ["欣賞你懂得把除數上下倒轉, ", "並以連乘法及約簡來計算答案 \\circ ", "很重要的是在計算分數乘除法時", "需把所有帶分數化成假分數, ", "這樣便能求得正確答案 \\circ "],
          ["欣賞你懂得先把三個帶分數", "都化成假分數 \\circ 但在乘除混合", "計算中,並不是先計算乘法, ", "而是由左至右計算, ", "所以應先計算20 \\frac{_1}{^4} \\div 4 \\frac{_1}{^2} "],
          ["先把三個", "帶分數都化成假分數,然後把", "除數 \\div \\frac{_9}{^2} 上下倒轉成 \\times \\frac{_2}{^9} , ", "最後以連乘法及約簡", "來求得正確答案 \\circ"]],
         [["先把三個", "帶分數都化成假分數,然後把", "除數 \\div \\frac{_2_0}{^3} 上下倒轉成 \\times \\frac{_3}{^2^0} , ", "最後以連乘法及約簡", "來求得正確答案 \\circ"],
          ["欣賞你懂得把除數上下倒轉, ", "並以連乘法及約簡來計算答案 \\circ ", "很重要的是在計算分數乘除法時", "需把所有帶分數化成假分數, ", "這樣便能求得正確答案 \\circ "],
          ["欣賞你懂得先把三個帶分數", "都化成假分數 \\circ 但在乘除混合", "計算中,並不是先計算乘法, ", "而是由左至右計算, ", "所以應先計算12 \\frac{_1}{^2} \\div 6 \\frac{_2}{^3} "],
          ["先把三個", "帶分數都化成假分數,然後把", "除數 \\div \\frac{_2_0}{^3} 上下倒轉成 \\times \\frac{_3}{^2^0} , ", "最後以連乘法及約簡", "來求得正確答案 \\circ"]]],
        //17
        [[["欣賞你懂得運用除法來算出雜莓", "的總重量包含了多少個1 \\frac{_1}{^5} kg \\circ ", "但小心計算雜莓總重量的加法", "需要先計,所以要有括號表示", "兩重量相加的優先 \\circ"],
          ["欣賞你能先運用加法和括號來", "計算雜莓的總重量 \\circ 每1 \\frac{_1}{^5} kg", "可製作1L乳酪,即是問雜莓的", "重量包含多少個1 \\frac{_1}{^5} kg, ", "這時候要用甚麼方法?"],
          ["算式正確!欣賞你能理解先運用", "加法和括號來計算雜莓的總重量, ", "然後再以除法來算出雜莓的總重", "量包含了多少個1 \\frac{_1}{^5} kg, ", "即是可製作多少L乳酪 \\circ"],
          ["這兒有藍莓和紅莓,先運用加法", "和括號來計算雜莓的總重量, ", "然後再以除法來算出雜莓的", "總重量包含了多少個1 \\frac{_1}{^5} kg, ", "即是可製作多少L乳酪 \\circ"]],
         [["算式正確!欣賞你能理解先運用", "加法和括號來計算雜莓的總重量, ", "然後再以除法來算出雜莓的總重", "量包含了多少個1 \\frac{_1}{^6} kg, ", "即是可製作多少L乳酪 \\circ"],
          ["欣賞你懂得運用除法來算出雜莓", "的總重量包含了多少個1 \\frac{_1}{^6} kg \\circ ", "但小心計算雜莓總重量的加法", "需要先計,所以要有括號表示", "兩重量相加的優先 \\circ"],
          ["欣賞你能先運用加法和括號來", "計算雜莓的總重量 \\circ 每1 \\frac{_1}{^6} kg", "可製作1L乳酪,即是問雜莓的", "重量包含多少個1 \\frac{_1}{^6} kg, ", "這時候要用甚麼方法?"],
          ["這兒有藍莓和紅莓,先運用加法", "和括號來計算雜莓的總重量, ", "然後再以除法來算出雜莓的", "總重量包含了多少個1 \\frac{_1}{^6} kg, ", "即是可製作多少L乳酪 \\circ"]]],
        //18 ans
        [[["在計算加法時", "先通分母:2 \\frac{_2_5}{^3^0} +2 \\frac{_8}{^3^0} ", " (30是6,15的公倍數),然後", "在計算除法時把帶分數化成", "假分數,及把除數 \\frac{_6}{^5} 上下倒轉 \\circ "],
          ["你懂得在計算加法時先通分母, ", "又能在計算除法時把帶分數化成", "假分數,及把除數上下倒轉, ", "然後約簡 \\circ 但當得出一個", "假分數時,需把它化成帶分數 \\circ"],
          ["你懂得在計算加法時先通分母, ", "又能在計算除法時把帶分數化成", "假分數,及把除數上下倒轉 \\circ 這時", "除了需化成帶分數外,也需檢查", "是否約至最簡(3,12都可除以3) \\circ "],
          ["當計算加法而分母不相同的時候, ", "需要通分母(兩數擴分至分母", "相同),這時2 \\frac{_5}{^6} ->2 \\frac{_2_5}{ \\color{#ff0000}{^3^0}} , ", "2 \\frac{_4}{^1^5} ->2 \\frac{_8}{ \\color{#ff0000}{^3^0}} ,當分母相同時, ", "就可以分子相加,分母保持30 \\circ "]],
         [["在計算加法時", "先通分母:1 \\frac{_1_5}{^1^8} +2 \\frac{_8}{^1^8} ", " (18是6,9的公倍數),然後", "在計算除法時把帶分數化成", "假分數,及把除數 \\frac{_7}{^6} 上下倒轉 \\circ "],
          ["你懂得在計算加法時先通分母, ", "又能在計算除法時把帶分數化成", "假分數,及把除數上下倒轉, ", "然後約簡 \\circ 但當得出一個", "假分數時,需把它化成帶分數 \\circ"],
          ["你懂得在計算加法時先通分母, ", "又能在計算除法時把帶分數化成", "假分數,及把除數上下倒轉 \\circ 這時", "除了需化成帶分數外,也需檢查", "是否約至最簡(14,21都可除以7) \\circ "],
          ["當計算加法而分母不相同的時候, ", "需要通分母(兩數擴分至分母", "相同),這時1 \\frac{_5}{^6} ->1 \\frac{_1_5}{ \\color{#ff0000}{^1^8}} , ", "2 \\frac{_4}{^9} ->2 \\frac{_8}{ \\color{#ff0000}{^1^8}} ,當分母相同時, ", "就可以分子相加,分母保持18 \\circ "]]]]
    
    let correct = [[1,3],
                   [0,0],
                   [0,0],
                   [0,0],
                   [2,1],
                   [0,0],
                   //7
        [0,2 ],
        //8 ans
        [0,0 ],
        //9
        [2,3 ],
        //10 ans
        [0,0 ],
        //11
        [1,2 ],
        //12 ans
        [0,0 ],
        //13
        [0,3 ],
        //14 ans
        [0,0 ],
        //15
        [3,2 ],
        //16 ans
        [0,0 ],
        //17
        [2,0 ],
        //18 ans
        [0,0 ]]
    
    let audioFile = [["0_0", "0_1", "0_2", "0_3"],
                     ["1_0", "1_1", "1_2", "1_3"],
                     ["2_0", "2_1", "2_2", "2_3"],
                     ["3_0", "3_1", "3_2", "3_3"],
                     ["4_0", "4_1", "4_2", "4_3"],
                     ["5_0", "5_1", "5_2", "5_3"],
                     ["6_0", "6_1", "6_2", "6_3"],
                     ["7_0", "7_1", "7_2", "7_3"],
                     ["8_0", "8_1", "8_2", "8_3"],
                     ["9_0", "9_1", "9_2", "9_3"],
                     ["10_0", "10_1", "10_2", "10_3"],
                     ["11_0", "11_1", "11_2", "11_3"]]
    
}




